applications/test/dbsReactiveThermalFoam/TimeSplitting/differentTimeSteps/timeCoeff_1/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/




type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

fields  (T O2 CO2);

setFormat   csv;


writeControl    writeTime;

sets
(
    x-centerline
    {
        type    lineCell; // lineCell, lineCellFace
        axis    x;    // x, y, z, xyz
        start  (0      40e-6 0.0);
        end    (420e-6 40e-6 0.0);
    }

    y-centerline
    {
        type    lineCell; // lineCell, lineCellFace
        axis    y;    // x, y, z, xyz
        start  (110e-6 0.0 0.0);
        end    (110e-6 80e-6 0.0);
    }



 
    
);

// ************************************************************************* //
